Documents/АР17_РасторжениеДоговораАренды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>АР17_РасторжениеДоговораАренды</Name>
			<BasedOn>
				<xr:Item>Document.АР17_ЗаключениеДоговораАренды</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.АР_ПереданныеДокументы</xr:Item>
				<xr:Item>InformationRegister.АР_СтатусыОбъектовАренды</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация-арендодатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеДоговораАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерАкта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАкта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСоглашения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоглашения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоСтороныАрендодателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоСтороныАрендатора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Передан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Возвращен</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АР_Москва</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АР_СанктПетербург</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АР_СтатусДоговора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПостояннаяЧастьАренднойПлаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектАренды</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособНачисления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АР_СпособыНачисленияАренднойПлаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаСрокаАренды</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияСрокаАренды</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПеременнаяЧастьАренднойПлаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектАренды</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособНачисления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АР_СпособыНачисленияАренднойПлаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>7</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаСрокаАренды</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияСрокаАренды</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счетчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АР_Счетчики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентОтнесенияСчетчика</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбъектыАренды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектАренды</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Площадь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/АР_СтатусыОбъектовАренды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АР_СтатусыОбъектовАренды</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачалаАренды</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияАренды</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АР_СтатусыОбъектовАренды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_Счетчики</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентОтнесенияСчетчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Начисление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_Начисления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Акт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаУслуг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ГруппыУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Депозит</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаключениеДоговора</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеДоговораАренды</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_ИзменениеСтатусовОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиТЧ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/АР_СтатусыОбъектовАренды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>АР_СтатусыОбъектовАренды</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Свободен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВАренде</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРезерве</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаКонсервации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаКапитальномРемонте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выбыл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Иное</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/АР17_РасторжениеДоговораАренды/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура заполняет данные шапки по данным документа основания
Процедура ЗаполнитьСвойстваШапки() Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		ЗаполнениеДокументов.ЗаполнитьПоОснованию(ЭтотОбъект, ДокументОснование);
		ДатаОкончанияДоговора = ДокументОснование.ФактическоеОкончание;
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполняет данные табличных частей по данным документа основания
Процедура ЗаполнитьТабличныеЧасти() Экспорт
	
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаОкончания", Дата);
	Запрос.УстановитьПараметр("ЗаключениеДоговора", ДокументОснование);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ДатаДокумента", Дата);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Ссылка,
	|	МАКСИМУМ(АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Дата) КАК Дата
	|ПОМЕСТИТЬ втПоследняяДата
	|ИЗ
	|	Справочник.АР_ГрафикиИзмененияСтавокНаУслуги.ГрафикСтавок КАК АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок
	|ГДЕ
	|	АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Дата < &ДатаДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Ставка,
	|	АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Ссылка
	|ПОМЕСТИТЬ втГрафикСтавокСрезПоследних
	|ИЗ
	|	Справочник.АР_ГрафикиИзмененияСтавокНаУслуги.ГрафикСтавок КАК АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПоследняяДата КАК втПоследняяДата
	|		ПО АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Ссылка = втПоследняяДата.Ссылка
	|			И АР_ГрафикиИзмененияСтавокНаУслугиГрафикСтавок.Дата = втПоследняяДата.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АР_СтатусыОбъектовАрендыСрезПоследних.Услуга,
	|	АР_СтатусыОбъектовАрендыСрезПоследних.ОбъектАренды,
	|	АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды КАК ДатаНачалаСрокаАренды,
	|	ВЫБОР
	|		КОГДА АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды < &ДатаОкончания
	|			ТОГДА АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды
	|		ИНАЧЕ &ДатаОкончания
	|	КОНЕЦ КАК ДатаОкончанияСрокаАренды,
	|	ВЫБОР
	|		КОГДА втГрафикСтавокСрезПоследних.Ставка ЕСТЬ NULL 
	|			ТОГДА АР_СтавкиСрезПоследних.Ставка
	|		ИНАЧЕ втГрафикСтавокСрезПоследних.Ставка
	|	КОНЕЦ КАК Ставка,
	|	АР_СтавкиСрезПоследних.СпособНачисления,
	|	ВЫБОР
	|		КОГДА АР_СтавкиСрезПоследних.СпособНачисления.ЗаОбъектВЦелом
	|			ТОГДА 1
	|		ИНАЧЕ АР_СтавкиСрезПоследних.Площадь
	|	КОНЕЦ КАК Количество,
	|	АР_СтатусыОбъектовАрендыСрезПоследних.Услуга.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	АР_СтатусыОбъектовАрендыСрезПоследних.Счетчик,
	|	АР_СтатусыОбъектовАрендыСрезПоследних.КоэффициентОтнесенияСчетчика
	|ИЗ
	|	РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(
	|			&МоментВремени,
	|			ЗаключениеДоговора = &ЗаключениеДоговора
	|				И Услуга.АР_ПостояннаяЧастьОплаты = &ПостояннаяЧасть) КАК АР_СтатусыОбъектовАрендыСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АР_Ставки.СрезПоследних(&МоментВремени, ) КАК АР_СтавкиСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ втГрафикСтавокСрезПоследних КАК втГрафикСтавокСрезПоследних
	|			ПО АР_СтавкиСрезПоследних.Ставка.Ссылка = втГрафикСтавокСрезПоследних.Ссылка
	|		ПО АР_СтатусыОбъектовАрендыСрезПоследних.Регистратор = АР_СтавкиСрезПоследних.Регистратор
	|			И АР_СтатусыОбъектовАрендыСрезПоследних.ОбъектАренды = АР_СтавкиСрезПоследних.ОбъектАренды
	|			И АР_СтатусыОбъектовАрендыСрезПоследних.Услуга = АР_СтавкиСрезПоследних.Услуга
	|ГДЕ
	|	АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды < &ДатаОкончания";
	
	Запрос.УстановитьПараметр("ПостояннаяЧасть", Истина);
	ПостояннаяЧастьАренднойПлаты.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Запрос.УстановитьПараметр("ПостояннаяЧасть", Ложь);
	ПеременнаяЧастьАренднойПлаты.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

// Процедура предназначена для проверки статуса объекта аренды (объект должен быть свободным в течение
// всего срока аренды)
Процедура ПроверитьСтатусыОбъектовАренды(ИмяТабличнойЧасти, Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	ИмяСписка = ЭтотОбъект.Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти].Представление();
	
	// Проверим что нет услуг которые не заключали
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаключениеДоговора", ДокументОснование);
	Запрос.УстановитьПараметр("ВАренде", Перечисления.АР_СтатусыОбъектовАренды.ВАренде);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("ПостояннаяЧасть", ИмяТабличнойЧасти = "ПостояннаяЧастьАренднойПлаты");
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АР_СтатусыОбъектовАрендыСрезПоследних.Услуга,
	|	АР_СтатусыОбъектовАрендыСрезПоследних.ОбъектАренды
	|ИЗ
	|	РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(&МоментВремени, ЗаключениеДоговора = &ЗаключениеДоговора) КАК АР_СтатусыОбъектовАрендыСрезПоследних
	|ГДЕ
	|	АР_СтатусыОбъектовАрендыСрезПоследних.Статус = &ВАренде
	|	И АР_СтатусыОбъектовАрендыСрезПоследних.Услуга.АР_ПостояннаяЧастьОплаты = &ПостояннаяЧасть";

	Выборка = Запрос.Выполнить().Выбрать();
	
	Отбор = Новый Структура("ОбъектАренды, Услуга");
	Для Каждого СтрокаТЧ Из ЭтотОбъект[ИмяТабличнойЧасти] Цикл
		Выборка.Сбросить();
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаТЧ);
		Если Не Выборка.НайтиСледующий(Отбор) Тогда
			Префикс = ИмяТабличнойЧасти + "[" + Формат(СтрокаТЧ.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";
			ТекстСообщения = НСтр("ru = 'Услуга """ + Выборка.Услуга + """ по объекту аренды """ + Выборка.ОбъектАренды + """ не была заключена договором'");
			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Услуга'"),
			Выборка.НомерСтроки, ИмяСписка, ТекстСообщения);
			Поле = Префикс + "Услуга";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЕсли;
	КонецЦикла;    
		
КонецПроцедуры

// Проверим, возможно договор уже расторгнут
Процедура ПроверитьРасторжениеДоговора(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаключениеДоговора", ДокументОснование);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(Дата, ВидГраницы.Исключая));
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	АР_СтатусыОбъектовАрендыСрезПоследних.Регистратор
	|ИЗ
	|	РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(&МоментВремени, ЗаключениеДоговора = &ЗаключениеДоговора) КАК АР_СтатусыОбъектовАрендыСрезПоследних
	|ГДЕ
	|	АР_СтатусыОбъектовАрендыСрезПоследних.Регистратор ССЫЛКА Документ.АР17_РасторжениеДоговораАренды";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ТекстСообщения = НСтр("ru = 'Данное заключение договора уже расторгнуто документом """ + Выборка.Регистратор + """'");
		ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения(, "Корректность",
				НСтр("ru = 'Заключение договора'"),,, ТекстСообщения);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,
			"ДокументОснование", "Объект", Отказ);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ДанныеЗаполнения <> Неопределено И ТипДанныхЗаполнения <> Тип("Структура")
		И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
		ДокументОснование = ДанныеЗаполнения;
		Дата = ТекущаяДата();
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДокументОснование, "Организация,Контрагент,ДоговорКонтрагента,ДатаОкончанияДоговора");
		ЭтотОбъект.ОбъектыАренды.Загрузить(ДанныеЗаполнения.ОбъектыАренды.Выгрузить());
		Если ЗначениеЗаполнено(ДатаОкончанияДоговора) Тогда
			ЗаполнитьТабличныеЧасти();
		КонецЕсли;
		ЭтотОбъект.ДатаОкончанияДоговора = ДокументОснование.ФактическоеОкончание;
	КонецЕсли;

	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Дата = НачалоДня(ТекущаяДатаСеанса());
	Ответственный = Пользователи.ТекущийПользователь();

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый()); // + NAI Becar Гайфетдинов Р.И. от 15.09.2015 15:48
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	АР_ОбщиеПроцедуры.УстановкаДатыПереданДокумента(ЭтотОбъект, РежимЗаписи); // + NAI Becar Конюшок С.Н. от 19.01.2017 17:18 
	
	Если (Этотобъект.ПометкаУдаления) И (НЕ Ссылка.ПометкаУдаления) Тогда
        АР_ОбщиеПроцедуры.ОчиститьДвижения(ЭтотОбъект);
    КонецЕсли; 
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	// + NAI Becar Конюшок С.Н. от 12.01.2017 10:19 перенес на форму, тк сейчас отрабатывает при групповых обработках и закрытии месяца
	//+са
	//ПользовательСсылка = ПараметрыСеанса.ТекущийПользователь;
	//Если Не ПользовательСсылка.АР_Администратор Тогда
	//	Если ПользовательСсылка.АР_Москва Тогда
	//		ЭтотОбъект.АР_Москва = Истина;
	//	Иначе
	//		ЭтотОбъект.АР_СанктПетербург = Истина;
	//	КонецЕсли;
	//КонецЕсли;
	//-са
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Исключаем из проверки реквизиты, заполнение которых стало необязательным:
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	ПроверитьРасторжениеДоговора(Отказ);
	
	// Проверим, что доп.соглашение введено позднее Заключения договора
	Если ЗначениеЗаполнено(ДокументОснование) И МоментВремени().Сравнить(ДокументОснование.МоментВремени()) = -1 Тогда
		ТекстСообщения = НСтр("ru = 'Дополнительное соглашение должно быть введено позднее заключения договора'");
		ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения(, "Корректность",
				НСтр("ru = 'Дата'"),,, ТекстСообщения);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,
			"Дата", "Объект", Отказ);
	КонецЕсли;
	
	Если ДокументОснование.ФактическоеНачало > ДатаОкончанияДоговора Тогда
		ТекстСообщения = НСтр("ru = 'Дата заключения договора превышает дату окончания действия договора'");
		ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения(, "Корректность",
				НСтр("ru = 'Дата окончания договора'"),,, ТекстСообщения);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,
			"ДатаОкончанияДоговора", "Объект", Отказ);
	КонецЕсли;
	
	// Проверяем табличную часть "Постоянная часть арендной платы":
	//ИмяСписка = НСтр("ru = 'Постоянная часть арендной платы'");
	//Для каждого СтрокаТЧ Из ПостояннаяЧастьАренднойПлаты Цикл
	//	Префикс = "ПостояннаяЧастьАренднойПлаты[" + Формат(СтрокаТЧ.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";
	//	
	//	Если ЗначениеЗаполнено(СтрокаТЧ.ДатаНачалаСрокаАренды) И ЗначениеЗаполнено(СтрокаТЧ.ДатаОкончанияСрокаАренды) Тогда
	//		
	//		Если СтрокаТЧ.ДатаНачалаСрокаАренды < ДокументОснование.ФактическоеНачало Тогда
	//			ТекстСообщения = НСтр("ru = 'Дата начала аренды объекта меньше даты заключения договора'");
	//			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Дата начала срока аренды'"),
	//			СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
	//			Поле = Префикс + "ДатаНачалаСрокаАренды";
	//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
	//		КонецЕсли;
	//		
	//		Если СтрокаТЧ.ДатаОкончанияСрокаАренды > ДатаОкончанияДоговора Тогда
	//			ТекстСообщения = НСтр("ru = 'Дата окончания аренды объекта больше даты окончания действия договора'");
	//			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Дата окончания срока аренды'"),
	//			СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
	//			Поле = Префикс + "ДатаОкончанияСрокаАренды";
	//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
	//		КонецЕсли;
	//		
	//		// Проверим заполнение сроков аренды
	//		Если СтрокаТЧ.ДатаНачалаСрокаАренды > СтрокаТЧ.ДатаОкончанияСрокаАренды Тогда
	//			ТекстСообщения = НСтр("ru = 'Дата начала аренды не может превышать дату окончания'");
	//			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Дата начала срока аренды'"),
	//			СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
	//			Поле = Префикс + "ДатаНачалаСрокаАренды";
	//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
	//		КонецЕсли;	
	//					
	//	КонецЕсли;
	//	
	//	// Проверим корректность заполнения услуг
	//	Если Не СтрокаТЧ.Услуга.АР_ПостояннаяЧастьОплаты Тогда
	//		ТекстСообщения = НСтр("ru = 'Указанная услуга не соответствует назначению табличной части'");
	//		ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Услуга'"),
	//				СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
	//		Поле = Префикс + "Услуга";
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
	//	КонецЕсли;
	//			
	//КонецЦикла;
	//
	//ПроверитьСтатусыОбъектовАренды("ПостояннаяЧастьАренднойПлаты", Отказ);

	//// Проверяем табличную часть "Переменную часть арендной платы":
	//ИмяСписка = НСтр("ru = 'Переменная часть арендной платы'");
	//Для каждого СтрокаТЧ Из ПеременнаяЧастьАренднойПлаты Цикл
	//	Префикс = "ПеременнаяЧастьАренднойПлаты[" + Формат(СтрокаТЧ.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";
	//	
	//	Если ЗначениеЗаполнено(СтрокаТЧ.ДатаНачалаСрокаАренды) И ЗначениеЗаполнено(СтрокаТЧ.ДатаОкончанияСрокаАренды) Тогда
	//		
	//		Если СтрокаТЧ.ДатаНачалаСрокаАренды < ДокументОснование.ФактическоеНачало Тогда
	//			ТекстСообщения = НСтр("ru = 'Дата начала аренды объекта меньше даты заключения договора'");
	//			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Дата начала срока аренды'"),
	//			СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
	//			Поле = Префикс + "ДатаНачалаСрокаАренды";
	//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
	//		КонецЕсли;
	//		
	//		Если СтрокаТЧ.ДатаОкончанияСрокаАренды > ДатаОкончанияДоговора Тогда
	//			ТекстСообщения = НСтр("ru = 'Дата окончания аренды объекта больше даты окончания действия договора'");
	//			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Дата окончания срока аренды'"),
	//			СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
	//			Поле = Префикс + "ДатаОкончанияСрокаАренды";
	//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
	//		КонецЕсли;
	//		
	//		// Проверим заполнение сроков аренды
	//		Если СтрокаТЧ.ДатаНачалаСрокаАренды > СтрокаТЧ.ДатаОкончанияСрокаАренды Тогда
	//			ТекстСообщения = НСтр("ru = 'Дата начала аренды не может превышать дату окончания'");
	//			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Дата начала срока аренды'"),
	//			СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
	//			Поле = Префикс + "ДатаНачалаСрокаАренды";
	//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
	//		КонецЕсли;	
	//		
	//	КонецЕсли;
	//	
	//	// Проверим корректность заполнения услуг
	//	Если СтрокаТЧ.Услуга.АР_ПостояннаяЧастьОплаты Тогда
	//		ТекстСообщения = НСтр("ru = 'Указанная услуга не соответствует назначению табличной части'");
	//		ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Услуга'"),
	//				СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
	//		Поле = Префикс + "Услуга";
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
	//	КонецЕсли;
	//			
	//КонецЦикла;
	//
	//ПроверитьСтатусыОбъектовАренды("ПеременнаяЧастьАренднойПлаты", Отказ);
	
	// Удаляем из проверяемых реквизитов все, по которым автоматическая проверка не нужна:
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА

	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;

	ПараметрыПроведения = Документы.АР17_РасторжениеДоговораАренды.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ИНФОРМАЦИОННОЙ БАЗЫ

	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ
	
	//АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(ПараметрыПроведения.СтатусыОбъектовАренды, Движения, "АР_СтатусыОбъектовАренды", Отказ);
	
	//+са
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		ОбъектДок = ДокументОснование.ПолучитьОбъект();
		ОбъектДок.ФактическоеОкончание = Дата;
        ОбъектДок.Записать();
	КонецЕсли;
	//	
	АР_РаботаСоШтрихКодами.ПроверитьИУстановитьШКДокумента(ЭтотОбъект.Ссылка);
	//
	Если ЗначениеЗаполнено(ЭтотОбъект.Передан) и ЗначениеЗаполнено(ЭтотОбъект.Возвращен)
		или не ЗначениеЗаполнено(ЭтотОбъект.Передан) и не ЗначениеЗаполнено(ЭтотОбъект.Возвращен) 
		Тогда 
			НаборЗаписей = РегистрыНакопления.АР_ПереданныеДокументы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать();
	Иначе
	
		Если ЗначениеЗаполнено(ЭтотОбъект.Передан) Тогда
			ЭтотОбъект.Записать();
			НаборЗаписей = РегистрыНакопления.АР_ПереданныеДокументы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
			Запись = НаборЗаписей.ДобавитьПриход();
			Запись.Период = ЭтотОбъект.Передан;
			Запись.Документ = ЭтотОбъект.Ссылка;
			Запись.ПереданоЭкземпляров = 1;
			НаборЗаписей.Записать();
		КонецЕсли;	
			
		Если ЗначениеЗаполнено(ЭтотОбъект.Возвращен) Тогда
			ЭтотОбъект.Записать();
			НаборЗаписей = РегистрыНакопления.АР_ПереданныеДокументы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
			Запись = НаборЗаписей.ДобавитьРасход();
			Запись.Период = ЭтотОбъект.Возвращен;
			Запись.Документ = ЭтотОбъект.Ссылка;
			Запись.ПереданоЭкземпляров = 1;
			НаборЗаписей.Записать();
		КонецЕсли;
		
	КонецЕсли;	
	//-са

			
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();

	АР_ОбщиеПроцедуры.ОчиститьДвижения(ЭтотОбъект);
	
КонецПроцедуры

#КонецЕсли
